*** source code / literate programming
    To insert a snippet for source code: [SPC] i s and select begin_src

    Example 1 emacs-lisp
   #+BEGIN_SRC emacs-lisp
   (+ 3 55)

   #+END_SRC

   #+RESULTS:
   : 58

   and then pressing C-x C-e will show 58 in the mini buffer  

    Example 2 python
   #+BEGIN_SRC python
   print(3+43+43+4)
   

   #+END_SRC 
   C-c C-c inside the code block (not working)
   #+RESULTS:
   : None

